Tekla.Structures.TeklaStructuresInternal.Events
The Events class allows the user to register event listeners for Tekla Structures events.

Tekla.Structures.TeklaStructuresInternal.Events.TeklaStructuresExit
The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called
the user will no longer be able to perform any calls to Tekla Structures.

Tekla.Structures.TeklaStructuresInternal.Events.ModuleManagerUpdate
The ModuleManagerUpdate event.

Tekla.Structures.TeklaStructuresInternal.Events.OnTeklaStructuresExit(System.String,System.Object[])


Tekla.Structures.TeklaStructuresInternal.Events.OnModuleManagerUpdate


Tekla.Structures.TeklaStructuresInternal.Events.InitializeLifetimeService
Initializes the lifetime service.
Returns: Always null.

Tekla.Structures.TeklaStructuresInternal.Events.#ctor
Creates an empty events instance.

Tekla.Structures.TeklaStructuresInternal.Events.Register
Registers the instance to listen to the specified events.
More event delegates should not be added without calling UnRegister
first.

Tekla.Structures.TeklaStructuresInternal.Events.UnRegister
Unregisters the instance from listening to events.